<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"d008d18fb5d47722689083a1ea54a0f4f6d476f9cf99a0eb1e3471c9fbef1082","plan_job_ref":"Job Create Terraform plan (DEV) #9 at https://github.com/AudioProthese/openrms-core-infrastructure/actions/runs/14504513612","plan_out_hash":"5d13f59b4d5e116e352fdcd7eca9ce043d660ebf278a622afd6a54598a02ce7d","plan_hash":"b07b68384fc30b825339854e64eac24cc700c3bc4cfd0c50f54c99081c1e9a37","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.network.azurerm_network_security_group.nsg["aca"] will be created
+   resource "azurerm_network_security_group" "nsg" {
+       id                  = (known after apply)
+       location            = "francecentral"
+       name                = "openrmscore-dev-nsg-aca"
+       resource_group_name = "rg-openrmscore-dev"
+       security_rule       = [
+           {
+               access                                     = "Allow"
+               destination_address_prefix                 = "*"
+               destination_address_prefixes               = []
+               destination_application_security_group_ids = []
+               destination_port_range                     = "*"
+               destination_port_ranges                    = []
+               direction                                  = "Inbound"
+               name                                       = "Allow-aca-Inbound"
+               priority                                   = 100
+               protocol                                   = "*"
+               source_address_prefix                      = "*"
+               source_address_prefixes                    = []
+               source_application_security_group_ids      = []
+               source_port_range                          = "*"
+               source_port_ranges                         = []
#                (1 unchanged attribute hidden)
            },
        ]
+       tags                = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }
    }

  # module.network.azurerm_network_security_group.nsg["appgw"] will be created
+   resource "azurerm_network_security_group" "nsg" {
+       id                  = (known after apply)
+       location            = "francecentral"
+       name                = "openrmscore-dev-nsg-appgw"
+       resource_group_name = "rg-openrmscore-dev"
+       security_rule       = [
+           {
+               access                                     = "Allow"
+               destination_address_prefix                 = "*"
+               destination_address_prefixes               = []
+               destination_application_security_group_ids = []
+               destination_port_range                     = "*"
+               destination_port_ranges                    = []
+               direction                                  = "Inbound"
+               name                                       = "Allow-appgw-Inbound"
+               priority                                   = 100
+               protocol                                   = "*"
+               source_address_prefix                      = "*"
+               source_address_prefixes                    = []
+               source_application_security_group_ids      = []
+               source_port_range                          = "*"
+               source_port_ranges                         = []
#                (1 unchanged attribute hidden)
            },
        ]
+       tags                = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }
    }

  # module.network.azurerm_virtual_network.vnet will be created
+   resource "azurerm_virtual_network" "vnet" {
+       address_space                  = [
+           "10.10.0.0/16",
        ]
+       dns_servers                    = (known after apply)
+       guid                           = (known after apply)
+       id                             = (known after apply)
+       location                       = "francecentral"
+       name                           = "openrmscore-dev-vnet"
+       private_endpoint_vnet_policies = "Disabled"
+       resource_group_name            = "rg-openrmscore-dev"
+       subnet                         = [
+           {
+               address_prefixes                              = [
+                   "10.10.1.0/24",
                ]
+               default_outbound_access_enabled               = true
+               delegation                                    = [
+                   {
+                       name               = "aca-delegation"
+                       service_delegation = [
+                           {
+                               actions = [
+                                   "Microsoft.Network/virtualNetworks/subnets/action",
                                ]
+                               name    = "Microsoft.App/environments"
                            },
                        ]
                    },
                ]
+               id                                            = (known after apply)
+               name                                          = "openrmscore-dev-aca"
+               private_endpoint_network_policies             = "Disabled"
+               private_link_service_network_policies_enabled = true
+               service_endpoint_policy_ids                   = []
+               service_endpoints                             = []
#                (2 unchanged attributes hidden)
            },
+           {
+               address_prefixes                              = [
+                   "10.10.2.0/24",
                ]
+               default_outbound_access_enabled               = true
+               delegation                                    = []
+               id                                            = (known after apply)
+               name                                          = "openrmscore-dev-appgw"
+               private_endpoint_network_policies             = "Disabled"
+               private_link_service_network_policies_enabled = true
+               service_endpoint_policy_ids                   = []
+               service_endpoints                             = []
#                (2 unchanged attributes hidden)
            },
        ]
+       tags                           = {
+           "environment" = "dev"
+           "project"     = "openrmscore"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #9](https://github.com/AudioProthese/openrms-core-infrastructure/actions/runs/14504513612)